kb.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-07 Fri 18:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ArtS - Knowledge Base</title>
<meta name="author" content="Artem Smaznov" />
<meta name="description" content="Artem's site on linux
header" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="gruvbox.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">ArtS - Knowledge Base</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd04cfae">ssh</a>
<ul>
<li><a href="#org0ce4ce8">Extending Screens</a></li>
</ul>
</li>
<li><a href="#org786e69b">git</a>
<ul>
<li><a href="#org415a16a">Bare Repositories</a></li>
</ul>
</li>
<li><a href="#org774a649">sort</a></li>
<li><a href="#org0508a20">awk</a></li>
<li><a href="#orgc7c2ed9">date</a></li>
<li><a href="#org7ef5199">cmatrix</a></li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="index.html">Home</a></td>
<td class="org-left"><a href="kb.html">Knowledge Base</a></td>
<td class="org-left"><a href="games.html">Gaming</a></td>
</tr>
</tbody>
</table>

<div id="outline-container-orgd04cfae" class="outline-2">
<h2 id="orgd04cfae">ssh</h2>
<div class="outline-text-2" id="text-orgd04cfae">
</div>
<div id="outline-container-org0ce4ce8" class="outline-3">
<h3 id="org0ce4ce8">Extending Screens</h3>
<div class="outline-text-3" id="text-org0ce4ce8">
<p>
You can add another computer&rsquo;s monitor to your host&rsquo;s screen and control it using your keyboard and mouse as if it was an extra monitor. It can come in handy when working on 2 computers as you can control both with the same of keyboard and mouse.
</p>

<ul class="org-ul">
<li><code>user@host:port</code> specify the host to add to your screen.</li>
<li><code>-east</code> select which direction from your current monitors the new one will be added</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">ssh -YC user@host:port x2x -east -to :0.0
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org786e69b" class="outline-2">
<h2 id="org786e69b">git</h2>
<div class="outline-text-2" id="text-org786e69b">
</div>
<div id="outline-container-org415a16a" class="outline-3">
<h3 id="org415a16a">Bare Repositories</h3>
<div class="outline-text-3" id="text-org415a16a">
<p>
Turning off untracked files for git status for bare repositories.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #fabd2f;">git</span> config status.showUntrackedFiles off
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org774a649" class="outline-2">
<h2 id="org774a649">sort</h2>
<div class="outline-text-2" id="text-org774a649">
<p>
Print out unique lines of the file in descending order.
</p>
<div class="org-src-container">
<pre class="src src-shell">sort -u file
</pre>
</div>
</div>
</div>

<div id="outline-container-org0508a20" class="outline-2">
<h2 id="org0508a20">awk</h2>
<div class="outline-text-2" id="text-org0508a20">
<p>
Print the first column (separated by <code>:</code>) from <code>/etc/passwd</code>.
</p>
<div class="org-src-container">
<pre class="src src-shell">awk -F: <span style="color: #b8bb26;">'{print $1}'</span> /etc/passwd
</pre>
</div>

<p>
Print the first column (separated by <code>:</code>) from <code>/etc/passwd</code> where the 3rd column is
<code>1000</code>.
</p>
<div class="org-src-container">
<pre class="src src-shell">awk -F: <span style="color: #b8bb26;">'$3=="1000" {print $1}'</span> /etc/passwd
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc7c2ed9" class="outline-2">
<h2 id="orgc7c2ed9">date</h2>
<div class="outline-text-2" id="text-orgc7c2ed9">
<p>
Convert dates between different formats.
The example converts it to the Unix Epoch format that can be used to compare
different dates.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #fabd2f;">date</span> -d <span style="color: #b8bb26;">"12:30"</span> +%s
</pre>
</div>
</div>
</div>

<div id="outline-container-org7ef5199" class="outline-2">
<h2 id="org7ef5199">cmatrix</h2>
<div class="outline-text-2" id="text-org7ef5199">
<p>
Send any output (like cmatrix) to the TTY screen.
User needs to be logged in on the TTY and not have a Graphical environment
running. Best done over SSH on servers.
Might need <code>sudo</code> to be executed.
</p>
<div class="org-src-container">
<pre class="src src-shell">cmatrix &gt; /dev/tty2
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Artem Smaznov</p>
<p class="date">Created: 2022-01-07 Fri 18:04</p>
</div>
</body>
</html>
